#+title: Queueing control: Psychiatrists doing intakes
#+author: Nicky D. van Foreest
#+date: 2022:01:19

#+STARTUP: indent
#+STARTUP: overview
#+PROPERTY: header-args:shell :exports both
#+PROPERTY: header-args:emacs-lisp :eval no-export
#+PROPERTY: header-args:python :eval no-export
# +PROPERTY: header-args:python :session  :exports both   :dir "./figures/" :results output

#+OPTIONS: toc:nil author:nil date:nil title:t

#+LATEX_CLASS: subfiles
#+LATEX_CLASS_OPTIONS: [assignments]

#+begin_src emacs-lisp :exports results :results none :eval export
  (make-variable-buffer-local 'org-latex-title-command)
  (setq org-latex-title-command (concat "\\chapter{%t}\n"))
#+end_src
** Arrivals

We  start with run length 10 for demo purpose; later we extend to longer run times

#+begin_src python
a = np.random.poisson(11.8, 10)
print(a)
#+end_src

#+RESULTS:
: [12  9  7 13 14  9  9 11 12 10]


** Service capacity
#+begin_src python
def unbalanced(a):
    p = np.empty([5, len(a)])
    p[0, :] = 1.0 * np.ones_like(a)
    p[1, :] = 1.0 * np.ones_like(a)
    p[2, :] = 1.0 * np.ones_like(a)
    p[3, :] = 3.0 * np.ones_like(a)
    p[4, :] = 9.0 * np.ones_like(a)
    return p

p = unbalanced(a)
print(p)
#+end_src

#+RESULTS:
: [[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
:  [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
:  [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
:  [3. 3. 3. 3. 3. 3. 3. 3. 3. 3.]
:  [9. 9. 9. 9. 9. 9. 9. 9. 9. 9.]]

#+begin_exercise
Which psychiatrist does the most intakes per week?
#+end_exercise

** Include holidays

#+begin_src python
def spread_holidays(p):
    for j in range(len(a)):
        psych = j % 5
        p[psych, j] = 0

spread_holidays(p)
print(p)
#+end_src

#+RESULTS:
: [[0. 1. 1. 1. 1. 0. 1. 1. 1. 1.]
:  [1. 0. 1. 1. 1. 1. 0. 1. 1. 1.]
:  [1. 1. 0. 1. 1. 1. 1. 0. 1. 1.]
:  [3. 3. 3. 0. 3. 3. 3. 3. 0. 3.]
:  [9. 9. 9. 9. 0. 9. 9. 9. 9. 0.]]

#+begin_exercise
What is the long-run time average of the weekly capacity?
#+end_exercise


** Total weekly service capacity

#+begin_src python
s = np.sum(p, axis=0)
print(s)
#+end_src

#+RESULTS:
: [14. 14. 14. 12.  6. 14. 14. 14. 12.  6.]

#+begin_exercise
Explain why we need to take the sum over ~axis=0~ to compute  the average weekly capacity for the intakes.
#+end_exercise


** Synchronize holidays

What is the effect of all psychiatrists taking holidays in the same week?

#+begin_src python
a = np.random.poisson(11.8, 10)


def synchronize_holidays(p):
    for j in range(int(len(a) / 5)):
        p[:, 5 * j] = 0  # this

p = unbalanced(a)
synchronize_holidays(p)
print(p)
#+end_src

#+RESULTS:
| 0 | 1 | 1 | 1 | 1 | 0 | 1 | 1 | 1 | 1 |
| 0 | 1 | 1 | 1 | 1 | 0 | 1 | 1 | 1 | 1 |
| 0 | 1 | 1 | 1 | 1 | 0 | 1 | 1 | 1 | 1 |
| 0 | 3 | 3 | 3 | 3 | 0 | 3 | 3 | 3 | 3 |
| 0 | 9 | 9 | 9 | 9 | 0 | 9 | 9 | 9 | 9 |

#+begin_exercise
Explain how the code works. Specifically, what does the line marked as ~this~.
#+end_exercise

#+begin_exercise
Change the code such that psychiatrists go on holiday every 6 weeks. However, modify the weekly capacities of the psychiatrists such that the total average weekly capacity remains the same. Include your code, and check with a sum (over an appropriate axis) that the average weekly capacity is still the same after your changes.
#+end_exercise


#+begin_src python :results value file
np.random.seed(3)

a = np.random.poisson(11.8, 1000)
p = unbalanced(a)
spread_holidays(p)
s = np.sum(p, axis=0)
Q3 = computeQ(a, s)

plt.clf()
plt.plot(Q3)

p = balanced(a)
synchronize_holidays(p)
s = np.sum(p, axis=0)
Q4 = computeQ(a, s)

plt.plot(Q4)
plt.savefig("psych3.pdf")
#+end_src

#+begin_src python :results value file :exports results
"psych3.pdf"
#+end_src

#+RESULTS:
[[file:figures/psych3.pdf]]


\begin{exercise}
Just to improve your coding skills (and your creativity), formulate another vacation plan.
Implement this idea in code, and test its success/failure.
Make a graph to show its effect on the dynamics of the queue length.
(I don't mind whether your proposal works or not; as long as you `play' and investigate, all goes.)
Include your code---if you ported all this code to ~R~, then include your ~R~ code--- and comment on thex difficult points.
\end{exercise}

Most probably, your proposals  will also not solve the problem.
We need something smarter.

